tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1578_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16LF1578_H_
#define _PIC16LF1578_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define STATUS_DC                     6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define IOCIF                         25
#define INTF                          26
#define T0IF                          27
#define TMR0IF                        28
#define IOCIE                         29
#define INTE                          30
#define T0IE                          31
#define TMR0IE                        32
#define PEIE                          33
#define GIE                           34
#define PORTA                         35
#define RA0                           36
#define RA1                           37
#define RA2                           38
#define RA3                           39
#define RA4                           40
#define RA5                           41
#define PORTB                         42
#define RB4                           43
#define RB5                           44
#define RB6                           45
#define RB7                           46
#define PORTC                         47
#define RC0                           48
#define RC1                           49
#define RC2                           50
#define RC3                           51
#define RC4                           52
#define RC5                           53
#define RC6                           54
#define RC7                           55
#define PIR1                          56
#define TMR1IF                        57
#define TMR2IF                        58
#define TXIF                          59
#define RCIF                          60
#define ADIF                          61
#define TMR1GIF                       62
#define PIR2                          63
#define C1IF                          64
#define C2IF                          65
#define PIR3                          66
#define PWM1IF                        67
#define PWM2IF                        68
#define PWM3IF                        69
#define PWM4IF                        70
#define TMR0                          71
#define TMR1L                         72
#define TMR1H                         73
#define T1CON                         74
#define TMR1ON                        75
#define nT1SYNC                       76
#define T1OSCEN                       77
#define T1CKPS0                       78
#define T1CKPS                        79
#define T1CKPS1                       80
#define TMR1CS                        81
#define TMR1CS0                       82
#define TMR1CS1                       83
#define T1GCON                        84
#define T1GSS0                        85
#define T1GSS                         86
#define T1GSS1                        87
#define T1GVAL                        88
#define T1GGO_nDONE                   89
#define T1GGO                         90
#define T1GSPM                        91
#define T1GTM                         92
#define T1GPOL                        93
#define TMR1GE                        94
#define TMR2                          95
#define PR2                           96
#define T2CON                         97
#define T2CKPS0                       98
#define T2CKPS                        99
#define T2CKPS1                       100
#define TMR2ON                        101
#define T2OUTPS0                      102
#define T2OUTPS                       103
#define T2OUTPS1                      104
#define T2OUTPS2                      105
#define T2OUTPS3                      106
#define TRISA                         107
#define TRISA0                        108
#define TRISA1                        109
#define TRISA2                        110
#define TRISA3                        111
#define TRISA4                        112
#define TRISA5                        113
#define TRISB                         114
#define TRISB4                        115
#define TRISB5                        116
#define TRISB6                        117
#define TRISB7                        118
#define TRISC                         119
#define TRISC0                        120
#define TRISC1                        121
#define TRISC2                        122
#define TRISC3                        123
#define TRISC4                        124
#define TRISC5                        125
#define TRISC6                        126
#define TRISC7                        127
#define PIE1                          128
#define TMR1IE                        129
#define TMR2IE                        130
#define TXIE                          131
#define RCIE                          132
#define ADIE                          133
#define TMR1GIE                       134
#define PIE2                          135
#define C1IE                          136
#define C2IE                          137
#define PIE3                          138
#define PWM1IE                        139
#define PWM2IE                        140
#define PWM3IE                        141
#define PWM4IE                        142
#define OPTION_REG                    143
#define OPTION_REG_PS                 144
#define OPTION_REG_PS0                145
#define OPTION_REG_PS1                146
#define OPTION_REG_PS2                147
#define PSA                           148
#define T0SE                          149
#define TMR0SE                        150
#define T0CS                          151
#define TMR0CS                        152
#define INTEDG                        153
#define nWPUEN                        154
#define PCON                          155
#define nBOR                          156
#define nPOR                          157
#define nRI                           158
#define nRMCLR                        159
#define nRWDT                         160
#define STKUNF                        161
#define STKOVF                        162
#define WDTCON                        163
#define SWDTEN                        164
#define WDTPS                         165
#define WDTPS0                        166
#define WDTPS1                        167
#define WDTPS2                        168
#define WDTPS3                        169
#define WDTPS4                        170
#define OSCTUNE                       171
#define TUN0                          172
#define TUN                           173
#define TUN1                          174
#define TUN2                          175
#define TUN3                          176
#define TUN4                          177
#define TUN5                          178
#define OSCCON                        179
#define SCS0                          180
#define SCS                           181
#define SCS1                          182
#define IRCF                          183
#define IRCF0                         184
#define IRCF1                         185
#define IRCF2                         186
#define IRCF3                         187
#define SPLLEN                        188
#define OSCSTAT                       189
#define HFIOFS                        190
#define LFIOFR                        191
#define MFIOFR                        192
#define HFIOFL                        193
#define HFIOFR                        194
#define OSTS                          195
#define PLLR                          196
#define ADRESL                        197
#define ADRESH                        198
#define ADCON0                        199
#define ADON                          200
#define nDONE                         201
#define GO_nDONE                      202
#define GO                            203
#define ADGO                          204
#define CHS0                          205
#define CHS                           206
#define CHS1                          207
#define CHS2                          208
#define CHS3                          209
#define CHS4                          210
#define ADCON1                        211
#define ADPREF0                       212
#define ADPREF                        213
#define ADPREF1                       214
#define ADCS0                         215
#define ADCS                          216
#define ADCS1                         217
#define ADCS2                         218
#define ADFM                          219
#define ADCON2                        220
#define TRIGSEL0                      221
#define TRIGSEL                       222
#define TRIGSEL1                      223
#define TRIGSEL2                      224
#define TRIGSEL3                      225
#define LATA                          226
#define LATA0                         227
#define LATA1                         228
#define LATA2                         229
#define LATA4                         230
#define LATA5                         231
#define LATB                          232
#define LATB4                         233
#define LATB5                         234
#define LATB6                         235
#define LATB7                         236
#define LATC                          237
#define LATC0                         238
#define LATC1                         239
#define LATC2                         240
#define LATC3                         241
#define LATC4                         242
#define LATC5                         243
#define LATC6                         244
#define LATC7                         245
#define CM1CON0                       246
#define C1SYNC                        247
#define C1HYS                         248
#define C1SP                          249
#define C1POL                         250
#define C1OE                          251
#define C1OUT                         252
#define C1ON                          253
#define CM1CON1                       254
#define C1NCH0                        255
#define C1NCH                         256
#define C1NCH1                        257
#define C1NCH2                        258
#define C1PCH                         259
#define C1PCH0                        260
#define C1PCH1                        261
#define C1INTN                        262
#define C1INTP                        263
#define CM2CON0                       264
#define C2SYNC                        265
#define C2HYS                         266
#define C2SP                          267
#define C2POL                         268
#define C2OE                          269
#define C2OUT                         270
#define C2ON                          271
#define CM2CON1                       272
#define C2NCH0                        273
#define C2NCH                         274
#define C2NCH1                        275
#define C2NCH2                        276
#define C2PCH                         277
#define C2PCH0                        278
#define C2PCH1                        279
#define C2INTN                        280
#define C2INTP                        281
#define CMOUT                         282
#define MC1OUT                        283
#define MC2OUT                        284
#define BORCON                        285
#define BORRDY                        286
#define BORFS                         287
#define SBOREN                        288
#define FVRCON                        289
#define ADFVR0                        290
#define ADFVR                         291
#define ADFVR1                        292
#define CDAFVR0                       293
#define CDAFVR                        294
#define CDAFVR1                       295
#define TSRNG                         296
#define TSEN                          297
#define FVRRDY                        298
#define FVREN                         299
#define DACCON0                       300
#define DACPSS                        301
#define DACPSS0                       302
#define DACPSS1                       303
#define DACOE                         304
#define DACLPS                        305
#define DACEN                         306
#define DACCON1                       307
#define DACR0                         308
#define DACR                          309
#define DACR1                         310
#define DACR2                         311
#define DACR3                         312
#define DACR4                         313
#define ANSELA                        314
#define ANSA                          315
#define ANSA0                         316
#define ANSA1                         317
#define ANSA2                         318
#define ANSA4                         319
#define ANSELB                        320
#define ANSB4                         321
#define ANSB                          322
#define ANSB5                         323
#define ANSELC                        324
#define ANSC0                         325
#define ANSC                          326
#define ANSC1                         327
#define ANSC2                         328
#define ANSC3                         329
#define ANSC6                         330
#define ANSC7                         331
#define PMADRL                        332
#define PMADRH                        333
#define PMDATL                        334
#define PMDATH                        335
#define PMCON1                        336
#define RD                            337
#define WR                            338
#define WREN                          339
#define WRERR                         340
#define FREE                          341
#define LWLO                          342
#define CFGS                          343
#define PMCON2                        344
#define RCREG                         345
#define TXREG                         346
#define SPBRGL                        347
#define SPBRGH                        348
#define RCSTA                         349
#define RX9D                          350
#define OERR                          351
#define FERR                          352
#define ADDEN                         353
#define CREN                          354
#define SREN                          355
#define RX9                           356
#define SPEN                          357
#define TXSTA                         358
#define TX9D                          359
#define TRMT                          360
#define BRGH                          361
#define SENDB                         362
#define SYNC                          363
#define TXEN                          364
#define TX9                           365
#define CSRC                          366
#define BAUDCON                       367
#define ABDEN                         368
#define WUE                           369
#define BRG16                         370
#define SCKP                          371
#define RCIDL                         372
#define ABDOVF                        373
#define WPUA0                         374
#define WPUA                          375
#define WPUA1                         376
#define WPUA2                         377
#define WPUA3                         378
#define WPUA4                         379
#define WPUA5                         380
#define WPUB                          381
#define WPUB4                         382
#define WPUB5                         383
#define WPUB6                         384
#define WPUB7                         385
#define WPUC0                         386
#define WPUC                          387
#define WPUC1                         388
#define WPUC2                         389
#define WPUC3                         390
#define WPUC4                         391
#define WPUC5                         392
#define WPUC6                         393
#define WPUC7                         394
#define ODCONA                        395
#define ODA                           396
#define ODA0                          397
#define ODA1                          398
#define ODA2                          399
#define ODA4                          400
#define ODA5                          401
#define ODCONB                        402
#define ODB4                          403
#define ODB                           404
#define ODB5                          405
#define ODB6                          406
#define ODB7                          407
#define ODCONC                        408
#define ODC                           409
#define ODC0                          410
#define ODC1                          411
#define ODC2                          412
#define ODC3                          413
#define ODC4                          414
#define ODC5                          415
#define ODC6                          416
#define ODC7                          417
#define SLRCONA                       418
#define SLRA                          419
#define SLRA0                         420
#define SLRA1                         421
#define SLRA2                         422
#define SLRA4                         423
#define SLRA5                         424
#define SLRCONB                       425
#define SLRB                          426
#define SLRB4                         427
#define SLRB5                         428
#define SLRB6                         429
#define SLRB7                         430
#define SLRCONC                       431
#define SLRC                          432
#define SLRC0                         433
#define SLRC1                         434
#define SLRC2                         435
#define SLRC3                         436
#define SLRC4                         437
#define SLRC5                         438
#define SLRC6                         439
#define SLRC7                         440
#define INLVLA                        441
#define INLVLA0                       442
#define INLVLA1                       443
#define INLVLA2                       444
#define INLVLA3                       445
#define INLVLA4                       446
#define INLVLA5                       447
#define INLVLB4                       448
#define INLVLB                        449
#define INLVLB5                       450
#define INLVLB6                       451
#define INLVLB7                       452
#define INLVLC                        453
#define INLVLC0                       454
#define INLVLC1                       455
#define INLVLC2                       456
#define INLVLC3                       457
#define INLVLC4                       458
#define INLVLC5                       459
#define INLVLC6                       460
#define INLVLC7                       461
#define IOCAP                         462
#define IOCAP0                        463
#define IOCAP1                        464
#define IOCAP2                        465
#define IOCAP3                        466
#define IOCAP4                        467
#define IOCAP5                        468
#define IOCAN0                        469
#define IOCAN                         470
#define IOCAN1                        471
#define IOCAN2                        472
#define IOCAN3                        473
#define IOCAN4                        474
#define IOCAN5                        475
#define IOCAF0                        476
#define IOCAF                         477
#define IOCAF1                        478
#define IOCAF2                        479
#define IOCAF3                        480
#define IOCAF4                        481
#define IOCAF5                        482
#define IOCBP                         483
#define IOCBP4                        484
#define IOCBP5                        485
#define IOCBP6                        486
#define IOCBP7                        487
#define IOCBN4                        488
#define IOCBN                         489
#define IOCBN5                        490
#define IOCBN6                        491
#define IOCBN7                        492
#define IOCBF4                        493
#define IOCBF                         494
#define IOCBF5                        495
#define IOCBF6                        496
#define IOCBF7                        497
#define IOCCP0                        498
#define IOCCP                         499
#define IOCCP1                        500
#define IOCCP2                        501
#define IOCCP3                        502
#define IOCCP4                        503
#define IOCCP5                        504
#define IOCCP6                        505
#define IOCCP7                        506
#define IOCCN0                        507
#define IOCCN                         508
#define IOCCN1                        509
#define IOCCN2                        510
#define IOCCN3                        511
#define IOCCN4                        512
#define IOCCN5                        513
#define IOCCN6                        514
#define IOCCN7                        515
#define IOCCF0                        516
#define IOCCF                         517
#define IOCCF1                        518
#define IOCCF2                        519
#define IOCCF3                        520
#define IOCCF4                        521
