tiborsimon/embedded-tdd-headers/pic/8bit/pic16lf1578_tdd.h
#define PWM3LDCON_LDT                 1091
#define PWM3LDM                       1092
#define PWM3LDCON_LDA                 1093
#define PWM3LD                        1094
#define PWM3OFCON                     1095
#define PWM3OFS                       1096
#define PWM3OFCON_OFS0                1097
#define PWM3OFS0                      1098
#define PWM3OFCON_OFS                 1099
#define PWM3OFCON_OFS1                1100
#define PWM3OFS1                      1101
#define PWM3OFMC                      1102
#define PWM3OFCON_OFO                 1103
#define PWM3OFM0                      1104
#define PWM3OFCON_OFM0                1105
#define PWM3OFCON_OFM                 1106
#define PWM3OFM                       1107
#define PWM3OFM1                      1108
#define PWM3OFCON_OFM1                1109
#define PWM4PHL_PH                    1110
#define PWM4PHL                       1111
#define PWM4PHL0                      1112
#define PWM4PHL1                      1113
#define PWM4PHL2                      1114
#define PWM4PHL3                      1115
#define PWM4PHL4                      1116
#define PWM4PHL5                      1117
#define PWM4PHL6                      1118
#define PWM4PHL7                      1119
#define PWM4PHH                       1120
#define PWM4PHH0                      1121
#define PWM4PHH_PH                    1122
#define PWM4PHH1                      1123
#define PWM4PHH2                      1124
#define PWM4PHH3                      1125
#define PWM4PHH4                      1126
#define PWM4PHH5                      1127
#define PWM4PHH6                      1128
#define PWM4PHH7                      1129
#define PWM4DCL0                      1130
#define PWM4DCL                       1131
#define PWM4DCL_DC                    1132
#define PWM4DCL1                      1133
#define PWM4DCL2                      1134
#define PWM4DCL3                      1135
#define PWM4DCL4                      1136
#define PWM4DCL5                      1137
#define PWM4DCL6                      1138
#define PWM4DCL7                      1139
#define PWM4DCH0                      1140
#define PWM4DCH                       1141
#define PWM4DCH_DC                    1142
#define PWM4DCH1                      1143
#define PWM4DCH2                      1144
#define PWM4DCH3                      1145
#define PWM4DCH4                      1146
#define PWM4DCH5                      1147
#define PWM4DCH6                      1148
#define PWM4DCH7                      1149
#define PWM4PRL_PR                    1150
#define PWM4PRL                       1151
#define PWM4PRL0                      1152
#define PWM4PRL1                      1153
#define PWM4PRL2                      1154
#define PWM4PRL3                      1155
#define PWM4PRL4                      1156
#define PWM4PRL5                      1157
#define PWM4PRL6                      1158
#define PWM4PRL7                      1159
#define PWM4PRH0                      1160
#define PWM4PRH                       1161
#define PWM4PRH_PR                    1162
#define PWM4PRH1                      1163
#define PWM4PRH2                      1164
#define PWM4PRH3                      1165
#define PWM4PRH4                      1166
#define PWM4PRH5                      1167
#define PWM4PRH6                      1168
#define PWM4PRH7                      1169
#define PWM4OFL0                      1170
#define PWM4OFL                       1171
#define PWM4OFL_OF                    1172
#define PWM4OFL1                      1173
#define PWM4OFL2                      1174
#define PWM4OFL3                      1175
#define PWM4OFL4                      1176
#define PWM4OFL5                      1177
#define PWM4OFL6                      1178
#define PWM4OFL7                      1179
#define PWM4OFH                       1180
#define PWM4OFH_OF                    1181
#define PWM4OFH0                      1182
#define PWM4OFH1                      1183
#define PWM4OFH2                      1184
#define PWM4OFH3                      1185
#define PWM4OFH4                      1186
#define PWM4OFH5                      1187
#define PWM4OFH6                      1188
#define PWM4OFH7                      1189
#define PWM4TMRL0                     1190
#define PWM4TMRL_TMR                  1191
#define PWM4TMRL                      1192
#define PWM4TMRL1                     1193
#define PWM4TMRL2                     1194
#define PWM4TMRL3                     1195
#define PWM4TMRL4                     1196
#define PWM4TMRL5                     1197
#define PWM4TMRL6                     1198
#define PWM4TMRL7                     1199
#define PWM4TMRH                      1200
#define PWM4TMRH_TMR                  1201
#define PWM4TMRH0                     1202
#define PWM4TMRH1                     1203
#define PWM4TMRH2                     1204
#define PWM4TMRH3                     1205
#define PWM4TMRH4                     1206
#define PWM4TMRH5                     1207
#define PWM4TMRH6                     1208
#define PWM4TMRH7                     1209
#define PWM4CON                       1210
#define PWM4MODE                      1211
#define PWM4MODE0                     1212
#define PWM4CON_MODE                  1213
#define PWM4CON_MODE0                 1214
#define PWM4CON_MODE1                 1215
#define PWM4MODE1                     1216
#define PWM4POL                       1217
#define PWM4CON_POL                   1218
#define PWM4CON_OUT                   1219
#define PWM4OUT                       1220
#define PWM4CON_OE                    1221
#define PWM4OE                        1222
#define PWM4EN                        1223
#define PWM4CON_EN                    1224
#define PWM4INTE                      1225
#define PWM4INTE_PRIE                 1226
#define PWM4PRIE                      1227
#define PWM4INTE_DCIE                 1228
#define PWM4DCIE                      1229
#define PWM4PHIE                      1230
#define PWM4INTE_PHIE                 1231
#define PWM4OFIE                      1232
#define PWM4INTE_OFIE                 1233
#define PWM4INTF                      1234
#define PWM4PRIF                      1235
#define PWM4INTF_PRIF                 1236
#define PWM4INTF_DCIF                 1237
#define PWM4DCIF                      1238
#define PWM4PHIF                      1239
#define PWM4INTF_PHIF                 1240
#define PWM4OFIF                      1241
#define PWM4INTF_OFIF                 1242
#define PWM4CLKCON                    1243
#define PWM4CLKCON_CS0                1244
#define PWM4CS                        1245
#define PWM4CLKCON_CS                 1246
#define PWM4CS0                       1247
#define PWM4CLKCON_CS1                1248
#define PWM4CS1                       1249
#define PWM4PS0                       1250
#define PWM4CLKCON_PS0                1251
#define PWM4CLKCON_PS                 1252
#define PWM4PS                        1253
#define PWM4PS1                       1254
#define PWM4CLKCON_PS1                1255
#define PWM4PS2                       1256
#define PWM4CLKCON_PS2                1257
#define PWM4LDCON                     1258
#define PWM4LDS                       1259
#define PWM4LDCON_LDS0                1260
#define PWM4LDCON_LDS                 1261
#define PWM4LDS0                      1262
#define PWM4LDCON_LDS1                1263
#define PWM4LDS1                      1264
#define PWM4LDM                       1265
#define PWM4LDCON_LDT                 1266
#define PWM4LDCON_LDA                 1267
#define PWM4LD                        1268
#define PWM4OFCON                     1269
#define PWM4OFCON_OFS                 1270
#define PWM4OFS                       1271
#define PWM4OFCON_OFS0                1272
#define PWM4OFS0                      1273
#define PWM4OFCON_OFS1                1274
#define PWM4OFS1                      1275
#define PWM4OFMC                      1276
#define PWM4OFCON_OFO                 1277
#define PWM4OFM0                      1278
#define PWM4OFM                       1279
#define PWM4OFCON_OFM0                1280
#define PWM4OFCON_OFM                 1281
#define PWM4OFM1                      1282
#define PWM4OFCON_OFM1                1283
#define PPSLOCK                       1284
#define PPSLOCKED                     1285
#define INTPPS0                       1286
#define INTPPS                        1287
#define INTPPS1                       1288
#define INTPPS2                       1289
#define INTPPS3                       1290
#define INTPPS4                       1291
#define T0CKIPPS0                     1292
#define T0CKIPPS                      1293
#define T0CKIPPS1                     1294
#define T0CKIPPS2                     1295
#define T0CKIPPS3                     1296
#define T0CKIPPS4                     1297
#define T1CKIPPS0                     1298
#define T1CKIPPS                      1299
#define T1CKIPPS1                     1300
#define T1CKIPPS2                     1301
#define T1CKIPPS3                     1302
#define T1CKIPPS4                     1303
#define T1GPPS0                       1304
#define T1GPPS                        1305
#define T1GPPS1                       1306
#define T1GPPS2                       1307
#define T1GPPS3                       1308
#define T1GPPS4                       1309
#define CWG1INPPS0                    1310
#define CWG1INPPS                     1311
#define CWG1INPPS1                    1312
#define CWG1INPPS2                    1313
#define CWG1INPPS3                    1314
#define CWG1INPPS4                    1315
#define RXPPS0                        1316
#define RXPPS                         1317
#define RXPPS1                        1318
#define RXPPS2                        1319
#define RXPPS3                        1320
#define RXPPS4                        1321
#define CKPPS                         1322
#define CKPPS0                        1323
#define CKPPS1                        1324
#define CKPPS2                        1325
#define CKPPS3                        1326
#define CKPPS4                        1327
#define ADCACTPPS0                    1328
#define ADCACTPPS                     1329
#define ADCACTPPS1                    1330
#define ADCACTPPS2                    1331
#define ADCACTPPS3                    1332
#define ADCACTPPS4                    1333
#define RA0PPS                        1334
#define RA0PPS0                       1335
#define RA0PPS1                       1336
#define RA0PPS2                       1337
#define RA0PPS3                       1338
#define RA1PPS                        1339
#define RA1PPS0                       1340
#define RA1PPS1                       1341
#define RA1PPS2                       1342
#define RA1PPS3                       1343
#define RA2PPS                        1344
#define RA2PPS0                       1345
#define RA2PPS1                       1346
#define RA2PPS2                       1347
#define RA2PPS3                       1348
#define RA4PPS                        1349
#define RA4PPS0                       1350
#define RA4PPS1                       1351
#define RA4PPS2                       1352
#define RA4PPS3                       1353
#define RA5PPS                        1354
#define RA5PPS0                       1355
#define RA5PPS1                       1356
#define RA5PPS2                       1357
#define RA5PPS3                       1358
#define RB4PPS                        1359
#define RB4PPS0                       1360
#define RB4PPS1                       1361
#define RB4PPS2                       1362
#define RB4PPS3                       1363
#define RB5PPS                        1364
#define RB5PPS0                       1365
#define RB5PPS1                       1366
#define RB5PPS2                       1367
#define RB5PPS3                       1368
#define RB6PPS0                       1369
#define RB6PPS                        1370
#define RB6PPS1                       1371
#define RB6PPS2                       1372
#define RB6PPS3                       1373
#define RB7PPS0                       1374
#define RB7PPS                        1375
#define RB7PPS1                       1376
#define RB7PPS2                       1377
#define RB7PPS3                       1378
#define RC0PPS                        1379
#define RC0PPS0                       1380
#define RC0PPS1                       1381
#define RC0PPS2                       1382
#define RC0PPS3                       1383
#define RC1PPS_RC1PPS0                1384
#define RC1PPS                        1385
#define RC1PPS_RC1PPS1                1386
#define RC1PPS_RC1PPS2                1387
#define RC1PPS_RC1PPS3                1388
#define RC2PPS_RC1PPS0                1389
#define RC2PPS                        1390
#define RC2PPS_RC1PPS1                1391
#define RC2PPS_RC1PPS2                1392
#define RC2PPS_RC1PPS3                1393
#define RC3PPS                        1394
#define RC3PPS0                       1395
#define RC3PPS1                       1396
#define RC3PPS2                       1397
#define RC3PPS3                       1398
#define RC4PPS0                       1399
#define RC4PPS                        1400
#define RC4PPS1                       1401
#define RC4PPS2                       1402
#define RC4PPS3                       1403
#define RC5PPS0                       1404
#define RC5PPS                        1405
#define RC5PPS1                       1406
#define RC5PPS2                       1407
#define RC5PPS3                       1408
#define RC6PPS                        1409
#define RC6PPS0                       1410
#define RC6PPS1                       1411
#define RC6PPS2                       1412
#define RC6PPS3                       1413
#define RC7PPS                        1414
#define RC7PPS0                       1415
#define RC7PPS1                       1416
#define RC7PPS2                       1417
#define RC7PPS3                       1418
#define STATUS_SHAD                   1419
#define C_SHAD                        1420
#define DC_SHAD                       1421
#define Z_SHAD                        1422
#define WREG_SHAD                     1423
#define BSR_SHAD                      1424
#define PCLATH_SHAD                   1425
#define FSR0L_SHAD                    1426
#define FSR0H_SHAD                    1427
#define FSR1L_SHAD                    1428
#define FSR1H_SHAD                    1429
#define STKPTR                        1430
#define TOSL                          1431
#define TOSH                          1432

#endif // _PIC16LF1578_H_
